In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./data/HR.csv')

In [3]:
df

,satisfaction_level,last_evaluation,number_project,average_monthly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...,...
14997,0.11,0.96,6,280,4,0,1,0,support,low
14998,0.37,0.52,2,158,3,0,1,0,support,low
14999,NaN,0.52,2,158,3,0,1,0,support,low
15000,NaN,999999.00,2,158,3,0,1,0,sale,low
15001,0.70,0.40,2,158,2,0,1,0,sale,nme

In [4]:
tsc_s = df['time_spend_company']

In [5]:
tsc_s.value_counts().sort_index()

2     3245
3     6445
4     2557
5     1473
6      718
7      188
8      162
10     214
Name: time_spend_company, dtype: int64

In [6]:
tsc_s.mean()

3.498066924410079

In [7]:
wa_s = df['Work_accident']

In [8]:
wa_s.value_counts()

0    12833
1     2169
Name: Work_accident, dtype: int64

In [9]:
# 事故率
wa_s.mean()

0.14458072257032395

In [10]:
l_s = df['left']

In [11]:
l_s.value_counts()

0    11428
1     3574
Name: left, dtype: int64

In [12]:
pl5_s = df['promotion_last_5years']

In [13]:
pl5_s.value_counts()

0    14683
1      319
Name: promotion_last_5years, dtype: int64

In [14]:
s_s = df['salary']

In [15]:
s_s.value_counts()

low       7318
medium    6446
high      1237
nme          1
Name: salary, dtype: int64

In [17]:
s_s.where(s_s=='nme')

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
14997    NaN
14998    NaN
14999    NaN
15000    NaN
15001    nme
Name: salary, Length: 15002, dtype: object

In [18]:
s_s.where(s_s!='nme')

0           low
1        medium
2        medium
3           low
4           low
          ...
14997       low
14998       low
14999       low
15000       low
15001       NaN
Name: salary, Length: 15002, dtype: object

In [20]:
s_s.where(s_s!='nme').dropna().value_counts()

low       7318
medium    6446
high      1237
Name: salary, dtype: int64

In [21]:
d_s = df['department']

In [23]:
d_s.value_counts(normalize=True)

sales          0.275963
technical      0.181309
support        0.148647
IT             0.081789
product_mng    0.060125
marketing      0.057192
RandD          0.052460
accounting     0.051127
hr             0.049260
management     0.041994
sale           0.000133
Name: department, dtype: float64

In [24]:
d_s.value_counts()

sales          4140
technical      2720
support        2230
IT             1227
product_mng     902
marketing       858
RandD           787
accounting      767
hr              739
management      630
sale              2
Name: department, dtype: int64

In [25]:
d_s = d_s.where(d_s!='sale')

In [26]:
d_s

0          sales
1          sales
2          sales
3          sales
4          sales
          ...
14997    support
14998    support
14999    support
15000        NaN
15001        NaN
Name: department, Length: 15002, dtype: object

In [29]:
d_s = d_s.dropna()

In [30]:
d_s

0          sales
1          sales
2          sales
3          sales
4          sales
          ...
14995    support
14996    support
14997    support
14998    support
14999    support
Name: department, Length: 15000, dtype: object